NOTICE
(Under Section 138 of Negotiable Instrument Act,1881)
Date: 20/09/2017
Mr. Sushil Joshi, s/o Mr. Prakash Joshi, Age 40 years,
r/o, 10/791 Malviya Nagar- 302020
Sub: Legal notice under section 138 of Negotiable Instruments Act for dishonor of
Cheque
Dear Sir,
Under the instructions and authority from my Client Mr. <Name> S/o <Father's Name>
residing at <Permanent address> (to be referred as my "Client"), I do hereby serve
notice of demand under Section 138 of the Negotiable Instrument Act, 1881:
That as per our Loan agreement dated 20/06/2017 amount of Rs. 2000000 /- is
to be submitted by you to my client as a security deposit for personal use. (to be
referred as "Loan").
2
That as per the terms of our Agreement, you issued four post dated cheque
bearing no. 29561 dated 01/09/2017 of total Rs. 2000000 in order to discharge
your liability under the agreement and Indian laws. At the time of issuing the
cheque, you assured my client that the same is good for value and will be
honored as and when presented
The said cheque was presented on 09/09/2017 as for full amount but was
dishonored through return memo on 10/09/2017 stating Insufficient fund drawn
on HDFC Bank, Mansarovar , Jaipur.
4.That despite a number of reminders, you considerably have failed to make the
payment due to my client and did not accede to the genuine request of my client
Furthermore, you started to put matter off and on, on the one pretext or the other.
Now, since all the efforts made by my clients to receive what was due, my client
has no other option but to get you served with the present legal notice
That you have considerably failed to comply with the provisions of the law and
also failed to discharge your liability from your account. Thus, you have issued
,cheques which are bad for value and thereafter had got the same dishonored
intentionally and willfully.
That on account of the above facts, you are liable to be prosecuted under section
138 of the Negotiable Instrument Act, 1881as amended up to date under which
you are liable to be punished with the imprisonment which may extend to two
years or with fine which may extend to twice the amount of Cheque(s) or both
6.
That under these circumstances, I call upon you to make the payment of Rupees
2000000/- being the principle amount of the aforesaid cheques with the interest
on the loaned amount as per our agreement, The charges for dishonor of
cheques along with the notice fee to my client either in cash or by demand draft
or Cheque which ever mode suits you better, within the period of 15(Fifteen)
days from the date of the receipt of this notice, failing which I wll be bound to
take further necessary action under the provisions of Negotiable Instrument Act,
1881and Indian Penal Code,1860 against you in the competent court of law at
your own risk, cost(Litigation, travelling and other reasonable expenditure) and
consequences
PLEASE TAKE FINAL NOTICE.
7.
8.
Yours,
On behalf of:
Mr. Khagesh Kacchwal
102 Mansarovar, Jaipur
